app/controllers/store_controller.rb

SELECT "products".* FROM "products"   ORDER BY "products"."category_id" ASC, "products"."title" ASC
---
  def index
  	@products = Product.order(:category_id,:title)