app/views/products/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <div class="field">
    <%= f.select :category_id, options_from_collection_for_select(Category.all, :id, :name)  %>